renesas/rx-driver-package/source/r_qspi_smstr_rx/r_qspi_smstr_rx_vx.xx/r_qspi_smstr_rx/src/targets/rx65n/r_qspi_smstr_target_dev_port.c
/*******************************************************************************
* Function Name: r_qspi_smstr_io_reset
* Description  : Resets setting of ports used for QSPI.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_io_reset(uint8_t channel)
{
    r_qspi_smstr_mpc_disable(channel);    /* MPC : use as general I/O port.   */
}


/*******************************************************************************
* Function Name: r_qspi_smstr_mpc_enable
* Description  : Sets MPC registers of ports for QSPI.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_mpc_enable(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            /* ---- Setting of ports for QSPI channel 0 ---- */
            QSPI_CH0_PMR_DATAIO0    = 0;                        /* Use as general I/O port.                 */
            QSPI_CH0_PMR_DATAIO1    = 0;                        /* Use as general I/O port.                 */
            QSPI_CH0_PMR_DATAIO2    = 0;                        /* Use as general I/O port.                 */
            QSPI_CH0_PMR_DATAIO3    = 0;                        /* Use as general I/O port.                 */
            QSPI_CH0_PMR_CLK        = 0;                        /* Use as general I/O port.                 */
            if (0 == QSPI_CH0_PMR_CLK)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }

#ifdef QSPI_SMSTR_CFG_USE_FIT
            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_MPC);
#else
            QSPI_PWPR_BOWI          = 0;                        /* Enable writing PFSWE bit.                */
            QSPI_PWPR_PFSWE         = 1;                        /* Enable writing PFS registers.            */
            if (1 == QSPI_PWPR_PFSWE)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif /* QSPI_SMSTR_CFG_USE_FIT */

            QSPI_CH0_MPC_DATAIO0    = QSPI_MPCDATAIO0_ENABLE;   /* Set pin function to QSPI QIO0 pin.       */
            QSPI_CH0_MPC_DATAIO1    = QSPI_MPCDATAIO1_ENABLE;   /* Set pin function to QSPI QIO1 pin.       */
            QSPI_CH0_MPC_DATAIO2    = QSPI_MPCDATAIO2_ENABLE;   /* Set pin function to QSPI QIO2 pin.       */
            QSPI_CH0_MPC_DATAIO3    = QSPI_MPCDATAIO3_ENABLE;   /* Set pin function to QSPI QIO3 pin.       */
            QSPI_CH0_MPC_CLK        = QSPI_MPCCLK_ENABLE;       /* Set pin function to QSPI QSPCLK pin.     */
            if (QSPI_MPCCLK_ENABLE == QSPI_CH0_MPC_CLK)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }

#ifdef QSPI_SMSTR_CFG_USE_FIT
            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_MPC);
#else
            QSPI_PWPR_PFSWE         = 0;                        /* Disable writing PFS registers.           */
            QSPI_PWPR_BOWI          = 1;                        /* Disable writing PFSWE bit.               */
            if (1 == QSPI_PWPR_BOWI)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif /* QSPI_SMSTR_CFG_USE_FIT */

            QSPI_CH0_PMR_DATAIO0    = 1;                        /* Use as I/O port for peripheral function. */
            QSPI_CH0_PMR_DATAIO1    = 1;                        /* Use as I/O port for peripheral function. */
            QSPI_CH0_PMR_DATAIO2    = 1;                        /* Use as I/O port for peripheral function. */
            QSPI_CH0_PMR_DATAIO3    = 1;                        /* Use as I/O port for peripheral function. */
            QSPI_CH0_PMR_CLK        = 1;                        /* Use as I/O port for peripheral function. */
            if (1 == QSPI_CH0_PMR_CLK)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_mpc_disable
* Description  : Clears MPC registers of ports for QSPI.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_mpc_disable(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            /* ---- Setting of ports for QSPI channel 0 ---- */
            QSPI_CH0_PMR_DATAIO0    = 0;                        /* Use as general I/O port.                 */
            QSPI_CH0_PMR_DATAIO1    = 0;                        /* Use as general I/O port.                 */
            QSPI_CH0_PMR_DATAIO2    = 0;                        /* Use as general I/O port.                 */
            QSPI_CH0_PMR_DATAIO3    = 0;                        /* Use as general I/O port.                 */
            QSPI_CH0_PMR_CLK        = 0;                        /* Use as general I/O port.                 */
            if (0 == QSPI_CH0_PMR_CLK)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }

#ifdef QSPI_SMSTR_CFG_USE_FIT
            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_MPC);
#else
            QSPI_PWPR_BOWI          = 0;                        /* Enable writing PFSWE bit.                */
            QSPI_PWPR_PFSWE         = 1;                        /* Enable writing PFS registers.            */
            if (1 == QSPI_PWPR_PFSWE)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif /* QSPI_SMSTR_CFG_USE_FIT */

