renesas/rx-driver-package/source/r_qspi_smstr_rx/r_qspi_smstr_rx_vx.xx/r_qspi_smstr_rx/src/targets/rx65n/r_qspi_smstr_target_dev_port.c
            QSPI_CH0_MPC_DATAIO0    = QSPI_MPCDATAIO0_INIT;     /* Set pin function to Hi-Z.                */
            QSPI_CH0_MPC_DATAIO1    = QSPI_MPCDATAIO1_INIT;     /* Set pin function to Hi-Z.                */
            QSPI_CH0_MPC_DATAIO2    = QSPI_MPCDATAIO2_INIT;     /* Set pin function to Hi-Z.                */
            QSPI_CH0_MPC_DATAIO3    = QSPI_MPCDATAIO3_INIT;     /* Set pin function to Hi-Z.                */
            QSPI_CH0_MPC_CLK        = QSPI_MPCCLK_INIT;         /* Set pin function to Hi-Z.                */
            if (QSPI_MPCCLK_INIT == QSPI_CH0_MPC_CLK)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }

#ifdef QSPI_SMSTR_CFG_USE_FIT
            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_MPC);
#else
            QSPI_PWPR_PFSWE         = 0;                        /* Disable writing PFS registers.           */
            QSPI_PWPR_BOWI          = 1;                        /* Disable writing PFSWE bit.               */
            if (1 == QSPI_PWPR_BOWI)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif /* QSPI_SMSTR_CFG_USE_FIT */

#endif
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_dataio0_init
* Description  : Initializes setting of port for QMO/QIO0.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_dataio0_init(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            /* ---- Setting of port for QMO/QIO0 ---- */
            QSPI_CH0_ODR_DATAIO0    = 0;                /* Output type is CMOS output.              */
            QSPI_CH0_PCR_DATAIO0    = 0;                /* Disable input pull-up resistor.          */
            QSPI_CH0_DSCR_DATAIO0   = 1;                /* Drive capacity is High-drive output.     */
            QSPI_CH0_PDR_DATAIO0    = QSPI_SMSTR_IN;    /* Select input direction.                  */
            if (QSPI_SMSTR_IN == QSPI_CH0_PDR_DATAIO0)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_dataio0_reset
* Description  : Resets setting of port for QMO/QIO0.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_dataio0_reset(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            /* ---- Setting of port for QMO/QIO0 ---- */
            QSPI_CH0_PDR_DATAIO0    = QSPI_SMSTR_IN;  /* Select input direction.                  */
            QSPI_CH0_DSCR_DATAIO0   = 0;              /* Drive capacity is normal drive output.   */
            QSPI_CH0_PCR_DATAIO0    = 0;              /* Disable input pull-up resistor.          */
            QSPI_CH0_ODR_DATAIO0    = 0;              /* Output type is CMOS output.              */
            if (0 == QSPI_CH0_ODR_DATAIO0)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_dataio1_init
* Description  : Initializes setting of port for QMI/QIO1.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_dataio1_init(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            /* ---- Setting of port for QMI/QIO1 ---- */
            QSPI_CH0_ODR_DATAIO1    = 0;              /* Output type is CMOS output.              */
            QSPI_CH0_PCR_DATAIO1    = 0;              /* Disable input pull-up resistor.          */
            QSPI_CH0_DSCR_DATAIO1   = 1;              /* Drive capacity is High-drive output.     */
            QSPI_CH0_PDR_DATAIO1    = QSPI_SMSTR_IN;  /* Select input direction.                  */
            if (QSPI_SMSTR_IN == QSPI_CH0_PDR_DATAIO1)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_dataio1_reset
* Description  : Resets setting of port for QMI/QIO1.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_dataio1_reset(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            /* ---- Setting of port for QMI/QIO1 ---- */
            QSPI_CH0_PDR_DATAIO1    = QSPI_SMSTR_IN;  /* Select input direction.                  */
            QSPI_CH0_DSCR_DATAIO1   = 0;              /* Drive capacity is normal drive output.   */
            QSPI_CH0_PCR_DATAIO1    = 0;              /* Disable input pull-up resistor.          */
            QSPI_CH0_ODR_DATAIO1    = 0;              /* Output type is CMOS output.              */
            if (0 == QSPI_CH0_ODR_DATAIO1)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


