renesas/rx-driver-package/source/r_qspi_smstr_rx/r_qspi_smstr_rx_vx.xx/r_qspi_smstr_rx/src/targets/rx65n/r_qspi_smstr_target_dev_port.c
    return QSPI_SMSTR_SUCCESS;
}


/**********************************************************************************************************************
 * Function Name: R_QSPI_SMstr_Int_Spri_Dmacdtc_flag_Set
 *****************************************************************************************************************/ /**
 * @brief This function is used to set the DMAC or DTC transfer-end flag for data reception.
 * @param[in] channel
 *             QSPI channel number
 * @param[in] flg
 *             Flag. The settings are as follows.\n
 *             QSPI_SET_TRANS_STOP : DMAC or DTC transfer-end\n
 *             (QSPI_SET_TRANS_START  : DMAC or DTC transfer-start: Setting by the user is prohibited.)
 * @retval    QSPI_SMSTR_SUCCESS     Successful operation
 * @retval    QSPI_SMSTR_ERR_PARAM   Parameter error
 * @details   Set QSPI_SET_TRANS_STOP from within the handler of the SPRI interrupt generated at DMAC transfer-end.
 * @note      Do not use this function for software transfers or DTC transfers. Doing so could disrupt the transfer.
 */
qspi_smstr_status_t R_QSPI_SMstr_Int_Spri_Dmacdtc_Flag_Set(uint8_t channel, qspi_smstr_trans_flg_t flg)
{
    if ((QSPI_SET_TRANS_STOP != flg) && (QSPI_SET_TRANS_START != flg))
    {
        return QSPI_SMSTR_ERR_PARAM;
    }
    
    gs_qspi_int_spri_dmacdtc_flg[channel] = flg;
    
    return QSPI_SMSTR_SUCCESS;
}


/**********************************************************************************************************************
 * Function Name: R_QSPI_SMstr_1ms_Interval
 *****************************************************************************************************************/ /**
 * @brief This function increments the internal timer counter each time it is called.
 * @details   Increments the internal timer counter while waiting for the DMAC transfer or DTC transfer to finish.
 * @note      Use a timer or the like to call this function at 1 millisecond (ms) intervals.
 */
void R_QSPI_SMstr_1ms_Interval(void)
{
    uint8_t channel = 0;

    /* WAIT_LOOP */
    for (channel = 0; channel < QSPI_NUM_CHANNELS; channel++)
    {
        if (gs_qspi_timer_cnt_out[channel][QSPI_TIMER_CH_FLG] != 0)
        {
            gs_qspi_timer_cnt_out[channel][QSPI_TIMER_CH_COUNT]++;
        }
    }

    return;
}


/*******************************************************************************
* Function Name: r_qspi_smstr_start_timer
* Description  : Sets timer for checking timeout and start timer.
* Arguments    : channel -
*                    Which channel to use
*              : msec -
*                    timeout(msec order)
* Return Value : none
*******************************************************************************/
static void r_qspi_smstr_start_timer(uint8_t channel, uint32_t msec)
{
    gs_qspi_timer_cnt_out[channel][QSPI_TIMER_CH_FLG] = 1;
    gs_qspi_timer_cnt_out[channel][QSPI_TIMER_CH_COUNT] = 0;
    gs_qspi_timer_cnt_out[channel][QSPI_TIMER_CH_MAX_COUNT] = (uint32_t)(msec);
}


/*******************************************************************************
* Function Name: r_qspi_smstr_check_timer
* Description  : Checks timeout to set r_qspi_smstr_start_timer function.
*              : If timeout,return QSPI_SMSTR_ERR_HARD. 
*              : In the case of others, return QSPI_SMSTR_SUCCESS.
* Arguments    : channel -
*                    Which channel to use
* Return Value : QSPI_SMSTR_SUCCESS -
*                    Successful operation
*                QSPI_SMSTR_ERR_HARD -
*                    Hardware error
*******************************************************************************/
static qspi_smstr_status_t r_qspi_smstr_check_timer(uint8_t channel)
{
    qspi_smstr_status_t ret = QSPI_SMSTR_SUCCESS;
    uint32_t gs_qspi_timer_cnt_out1 = gs_qspi_timer_cnt_out[channel][QSPI_TIMER_CH_COUNT];
    uint32_t gs_qspi_timer_cnt_out2 = gs_qspi_timer_cnt_out[channel][QSPI_TIMER_CH_MAX_COUNT];

    /* ---- Check compare ---- */
    if (gs_qspi_timer_cnt_out1 >= gs_qspi_timer_cnt_out2)
    {
        ret = QSPI_SMSTR_ERR_HARD;
    }
    else
    {
        ret = QSPI_SMSTR_SUCCESS;
    }

    return ret;
}


/*******************************************************************************
* Function Name: r_qspi_smstr_end_timer
* Description  : Stops timer to set r_qspi_smstr_start_timer function.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
static void r_qspi_smstr_end_timer(uint8_t channel)
{
    gs_qspi_timer_cnt_out[channel][QSPI_TIMER_CH_FLG] = 0;
}


#endif /* defined(BSP_MCU_RX65N) */

/* End of File */

